app/controllers/posts_controller.rb

INSERT INTO `posts` (`name`, `body`, `topic_id`, `created_at`, `updated_at`) VALUES ('あやの', 'みなさんのおすすめのヘアアレンジを教えてください〜', 1, '2020-11-11 08:27:31.211581', '2020-11-11 08:27:31.211581')
---
    def create
        @post = Post.new(params[:post].permit(:topic_id, :name, :body))
        @post.save